StoveOpt/foamfiles/counterFlowFlame2D/old/case_150/0/adapts/H2_created.txt
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      H2; // hydrogen object
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    fuel
    {
        type            fixedValue;
        value           uniform 0.032; // per UW volatiles
    }
    primary_air
    {
        type            fixedValue;
        value           uniform 0;
    }
    outlet
    {
        type            inletOutlet;
        inletValue      uniform 0;
        value           uniform 0;
    secondary_air_LHS
    {
        type            fixedValue;
        value           uniform 0;
    }

    secondary_air_RHS
    {
        type            fixedValue;
        value           uniform 0;
    }
    }
    frontAndBack
    {
        type            empty;
    }
}


// ************************************************************************* //
